hackathon/src/Catalogs/Обращения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Обращения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тональность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТональностьОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Внешний</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

hackathon/src/Catalogs/Обращения/ObjectModule.bsl
Перем СтарыйИсполнитель;
Перем ЭтоНовыйОбъект;

Процедура ПередЗаписью(Отказ)
    
    // Сохраняем признак нового объекта
    ЭтоНовыйОбъект = ЭтоНовый();
    
    // Сохраняем старого исполнителя
    Если НЕ ЭтоНовыйОбъект Тогда
        СтарыйИсполнитель = Ссылка.Исполнитель;
    Иначе
        СтарыйИсполнитель = Неопределено;
    КонецЕсли;
    
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
    
    // Проверяем флаг отключения оповещений
    Если ДополнительныеСвойства.Свойство("БезОповещения") Тогда
        Возврат;
    КонецЕсли;
    
    // Проверяем, что исполнитель заполнен
    Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
        Возврат;
    КонецЕсли;
    
    СоздаватьОповещение = Ложь;
    
    // Условие 1: Новое обращение с исполнителем
    Если ЭтоНовыйОбъект Тогда
        СоздаватьОповещение = Истина;
    КонецЕсли;
    
    // Условие 2: Изменился исполнитель
    Если НЕ ЭтоНовыйОбъект И (СтарыйИсполнитель <> Исполнитель) Тогда
        СоздаватьОповещение = Истина;
    КонецЕсли;
    
    // Создаем оповещение
    Если СоздаватьОповещение Тогда
        
        Заголовок = "Новое обращение!";
        
        // ИСПРАВЛЕННЫЙ ТЕКСТ - с кодом обращения
        Текст = СтрШаблон(
            "Вам назначено обращение %1%2Приоритет: %3, Статус: %4",
            Код,  // ИЛИ Номер - в зависимости от того, что используется
            Символы.ПС,
            Приоритет,
            Статус
        );
        
        УникальныйКлюч = "Обращение_" + Строка(Ссылка);
        
        // Вызываем серверную функцию создания оповещения
        ОповещенияСервер.СоздатьОповещение(
            Исполнитель,
            Заголовок,
            Текст,
            Ссылка,
            УникальныйКлюч
        );
        
    КонецЕсли;
    
КонецПроцедуры
